NAME : MAHEK SHAH ,
 ID : 22000248 ,
 SYBCA ,
 BATCH A.

TASK 1
1. Create 3 list viz. productId, Product Name, Product Price with 5 elements each.
Add this element to create a DataFrame.

In [3]:
import pandas as pd
productId = [101, 102, 103, 104, 105]
productName = ['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Camera']
productPrice = [500, 700, 300, 100, 900]
df = pd.DataFrame({'Product ID': productId, 'Product Name': productName, 'Product Price': productPrice})
df

   Product ID Product Name  Product Price
0         101       Laptop            500
1         102   Smartphone            700
2         103       Tablet            300
3         104   Headphones            100
4         105       Camera            900

2. Extract one by one column and display separately from above dataframe.

In [4]:
df['Product ID']

0    101
1    102
2    103
3    104
4    105
Name: Product ID, dtype: int64

In [5]:
df['Product Name']

0        Laptop
1    Smartphone
2        Tablet
3    Headphones
4        Camera
Name: Product Name, dtype: object

In [6]:
df['Product Price']

0    500
1    700
2    300
3    100
4    900
Name: Product Price, dtype: int64

3. Display separately each and every row from an above dataframe. (use loc or iloc function)

In [7]:
df.loc[0]

Product ID          101
Product Name     Laptop
Product Price       500
Name: 0, dtype: object

In [8]:
df.loc[1]

Product ID              102
Product Name     Smartphone
Product Price           700
Name: 1, dtype: object

In [9]:
df.loc[2]

Product ID          103
Product Name     Tablet
Product Price       300
Name: 2, dtype: object

In [10]:
df.loc[3]

Product ID              104
Product Name     Headphones
Product Price           100
Name: 3, dtype: object

In [11]:
df.loc[4]

Product ID          105
Product Name     Camera
Product Price       900
Name: 4, dtype: object

4. Display product name from 3 row using loc function.

In [12]:
df['Product Name'].loc[[0,1,2]]

0        Laptop
1    Smartphone
2        Tablet
Name: Product Name, dtype: object

5. Display price located in 2 row using iloc function.

In [13]:
df['Product Price'].iloc[1]

700

6. Display 2nd to 4th row data excluding price

In [14]:
df[['Product ID','Product Name']].loc[2:4]

   Product ID Product Name
2         103       Tablet
3         104   Headphones
4         105       Camera

7. Display 1 to 3rd row price data only.

In [15]:
df['Product Price'].loc[1:3]

1    700
2    300
3    100
Name: Product Price, dtype: int64

8. Change marks in python column to 41 for students who have scored less than 40.

In [47]:
data = [[77,56,34,67,41,56,78,12],
        [58,40,24,38,14,66,54,44],
        [74,32,41,76,13,30,40,45],
        [4,16,66,47,1,52,78,12],
        [14,0,74,28,17,58,52,24]]
df = pd.DataFrame(data , columns=["OOAD","Data Science","Statistics","Python","Sci","Maths","c#","Java"] , index = ["Mahek","Diya","Shweta","Vraj","Het"])
df

        OOAD  Data Science  Statistics  Python  Sci  Maths  c#  Java
Mahek     77            56          34      67   41     56  78    12
Diya      58            40          24      38   14     66  54    44
Shweta    74            32          41      76   13     30  40    45
Vraj       4            16          66      47    1     52  78    12
Het       14             0          74      28   17     58  52    24

In [48]:
marks=df['Maths']<40
df.loc[marks,'Maths']=45
df

        OOAD  Data Science  Statistics  Python  Sci  Maths  c#  Java
Mahek     77            56          34      67   41     56  78    12
Diya      58            40          24      38   14     66  54    44
Shweta    74            32          41      76   13     45  40    45
Vraj       4            16          66      47    1     52  78    12
Het       14             0          74      28   17     58  52    24

9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100

In [18]:
import pandas as pd
data = [
    [77, 56, 34, 67, 41, 56, 78, 12],
    [58, 40, 24, 38, 14, 66, 54, 44],
    [74, 58, 41, 69, 13, 21, 53, 45],
    [4, 60, 37, 70, 1, 52, 99, 12],
    [14, 0, 74, 28, 17, 58, 52, 24]
]
columns = ["OOAD", "Data Science", "Statistics", "Python", "Sci", "Maths", "c#", "Java"]
index = ["Aashtha", "Diya", "Shweta", "Vraj", "Het"]
df = pd.DataFrame(data, columns=columns, index=index)
def add_marks(row):
    return min(100, row + 2)
df = df.applymap(add_marks)
df

         OOAD  Data Science  Statistics  Python  Sci  Maths   c#  Java
Aashtha    79            58          36      69   43     58   80    14
Diya       60            42          26      40   16     68   56    46
Shweta     76            60          43      71   15     23   55    47
Vraj        6            62          39      72    3     54  100    14
Het        16             2          76      30   19     60   54    26

10. Display students who have scored more than 50 marks in python and more than 60 marks in data science

In [19]:
df[(df['Python']>50) | (df['Data Science']>60)]

         OOAD  Data Science  Statistics  Python  Sci  Maths   c#  Java
Aashtha    79            58          36      69   43     58   80    14
Shweta     76            60          43      71   15     23   55    47
Vraj        6            62          39      72    3     54  100    14

11. Display students records whose name starts with letter S

In [20]:
df[df.index.str.startswith('S')]

        OOAD  Data Science  Statistics  Python  Sci  Maths  c#  Java
Shweta    76            60          43      71   15     23  55    47

12. Display students records whose name ends with letter a.

In [21]:
df[df.index.str.endswith('a')]

         OOAD  Data Science  Statistics  Python  Sci  Maths  c#  Java
Aashtha    79            58          36      69   43     58  80    14
Diya       60            42          26      40   16     68  56    46
Shweta     76            60          43      71   15     23  55    47

13. Calculate total and percentage for all the students.

In [22]:
import pandas as pd
data = [
    [77, 56, 34, 67, 41, 56, 78, 12],
    [58, 40, 24, 38, 14, 66, 54, 44],
    [74, 58, 41, 69, 13, 21, 53, 45],
    [4, 60, 37, 70, 1, 52, 99, 12],
    [14, 0, 74, 28, 17, 58, 52, 24]
]
columns = ["OOAD", "Data Science", "Statistics", "Python", "Sci", "Maths", "c#", "Java"]
index = ["Aashtha", "Diya", "Shweta", "Vraj", "Het"]
df = pd.DataFrame(data, columns=columns, index=index)
df['Total'] = df.sum(axis=1)
df['Percentage'] = (df['Total'] / len(columns)) * 100
df

,OOAD,Data Science,Statistics,Python,Sci,Maths,c#,Java,Total,Percentage
Aashtha,77,56,34,67,41,56,78,12,421,5262.5
Diya,58,40,24,38,14,66,54,44,338,4225.0
Shweta,74,58,41,69,13,21,53,45,374,4675.0
Vraj,4,60,37,70,1,52,99,12,335,4187.5
Het,14,0,74,28,17,58,52,24,267,3337.5

14. Calculate Status (PASS / FAIL) for the Students.

In [23]:
 df.apply(lambda row: 'PASS' if row['Percentage'] >= 60 else 'FAIL', axis=1)

Aashtha    PASS
Diya       PASS
Shweta     PASS
Vraj       PASS
Het        PASS
dtype: object

15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade, per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then Fgrade)

In [24]:
import pandas as pd
data = [
    [77, 86, 54, 67, 91, 86, 78, 72],
    [58, 40, 24, 38, 14, 66, 54, 44],
    [74, 58, 71, 89, 93, 71, 93, 75],
    [84, 80, 87, 90, 71, 72, 79, 82],
    [94, 90, 94, 98, 97, 98, 92, 94]
]
columns = ["OOAD", "Data Science", "Statistics", "Python", "Sci", "Maths", "c#", "Java"]
index = ["Mahek", "Diya", "Shweta", "Vraj", "Het"]
df = pd.DataFrame(data, columns=columns, index=index)
df['Percentage'] = df.mean(axis=1)
def get_grade(percentage):
    if percentage >= 90:
        return 'A'
    elif percentage >= 80:
        return 'B'
    elif percentage >= 70:
        return 'C'
    elif percentage >= 60:
        return 'D'
    elif percentage >= 50:
        return 'E'
    else:
        return 'F'
df['Grade'] = df['Percentage'].apply(get_grade)
df

,OOAD,Data Science,Statistics,Python,Sci,Maths,c#,Java,Percentage,Grade
Mahek,77,86,54,67,91,86,78,72,76.375,C
Diya,58,40,24,38,14,66,54,44,42.250,F
Shweta,74,58,71,89,93,71,93,75,78.000,C
Vraj,84,80,87,90,71,72,79,82,80.625,B
Het,94,90,94,98,97,98,92,94,94.625,A

16. Also calculate overall columns total, maximum, minimum and standard deviation for each
numeric columns

In [25]:
df = pd.DataFrame(data, columns=columns, index=index)
results = pd.DataFrame({
    'Total': df.sum(),
    'Maximum': df.max(),
    'Minimum': df.min(),
    'Standard Deviation': df.std()
})
results

              Total  Maximum  Minimum  Standard Deviation
OOAD            387       94       58           13.296616
Data Science    354       90       40           21.194339
Statistics      330       94       24           28.098043
Python          382       98       38           24.357750
Sci             366       97       14           34.586124
Maths           393       98       66           13.145341
c#              396       93       54           15.738488
Java            367       94       44           18.487834

17. Display meta-data for each column for the above dataframe.

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Mahek to Het
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OOAD          5 non-null      int64
 1   Data Science  5 non-null      int64
 2   Statistics    5 non-null      int64
 3   Python        5 non-null      int64
 4   Sci           5 non-null      int64
 5   Maths         5 non-null      int64
 6   c#            5 non-null      int64
 7   Java          5 non-null      int64
dtypes: int64(8)
memory usage: 360.0+ bytes

18.Convert the above DataFrame to list within a dictionary.

In [27]:
dict_list = df.to_dict(orient='list')
dict_list

{'OOAD': [77, 58, 74, 84, 94],
 'Data Science': [86, 40, 58, 80, 90],
 'Statistics': [54, 24, 71, 87, 94],
 'Python': [67, 38, 89, 90, 98],
 'Sci': [91, 14, 93, 71, 97],
 'Maths': [86, 66, 71, 72, 98],
 'c#': [78, 54, 93, 79, 92],
 'Java': [72, 44, 75, 82, 94]}

19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column.

In [28]:
import pandas as pd

productId = [101, 102, 103, 104, 105]
productName = ['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Camera']
productPrice = [500, 700, 300, 100, 900]

df = pd.DataFrame({'Product ID': productId, 'Product Name': productName, 'Product Price': productPrice})
df['Product Price'] += 500
df

   Product ID Product Name  Product Price
0         101       Laptop           1000
1         102   Smartphone           1200
2         103       Tablet            800
3         104   Headphones            600
4         105       Camera           1400

Task 2
Using the SF Salaries Dataset from Kaggle! ,complete the tasks outlined in bold below
1. Import pandas as pd

In [2]:
import pandas as pd

2. Read Salaries.csv as a dataframe called sal.

In [3]:
sal = pd.read_csv('Salaries.csv')
sal

C:\Users\HP\AppData\Local\Temp\ipykernel_10844\1798377461.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

3. Check the head of the DataFrame.

In [4]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

4. Use the .info() method to find out how many entries there are.

In [5]:
sal['BasePay'] = pd.to_numeric(sal['BasePay'], errors='coerce')
sal['OvertimePay'] = pd.to_numeric(sal['OvertimePay'], errors='coerce')
sal['OtherPay'] = pd.to_numeric(sal['OtherPay'], errors='coerce')
sal['Benefits'] = pd.to_numeric(sal['Benefits'], errors='coerce')
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

5. What is the average BasePay ?

In [6]:
average_basepay = sal['BasePay'].mean()
average_basepay

66325.44884050643

6. What is the highest amount of OvertimePay in the dataset ?

In [7]:
highest_overtimepay = sal['OvertimePay'].max()
highest_overtimepay

245131.88

7. What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [8]:
joseph_driscoll_jobtitle = sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'].iloc[0]
joseph_driscoll_jobtitle

'CAPTAIN, FIRE SUPPRESSION'

8. How much does JOSEPH DRISCOLL make (including benefits)?

In [9]:
joseph_driscoll_salary = sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits'].iloc[0]
joseph_driscoll_salary

270324.91

9. What is the name of highest paid person (including benefits)?

In [10]:
highest_paid_person = sal.loc[sal['TotalPayBenefits'].idxmax()]['EmployeeName']
highest_paid_person

'NATHANIEL FORD'

10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [11]:
lowest_paid_person = sal.loc[sal['TotalPayBenefits'].idxmin()]
lowest_paid_person['EmployeeName']
lowest_paid_person['TotalPayBenefits']

-618.13

The salary seems to be negative, which is strange.

11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [12]:
average_basepay_per_year = sal.groupby('Year')['BasePay'].mean()
average_basepay_per_year

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

12. How many unique job titles are there?

In [137]:
unique_job_titles_count = sal['JobTitle'].nunique()
unique_job_titles_count

2159

13. What are the top 5 most common jobs?

In [138]:
top_5_common_jobs = sal['JobTitle'].value_counts().head()
top_5_common_jobs

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [40]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

15. How many people have the word Chief in their job title?

In [41]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

16. Is there a correlation between length of the Job Title string and Salary?

In [42]:
sal['TitleLength'] = sal['JobTitle'].apply(len)
correlation = sal[['TitleLength', 'TotalPayBenefits']].corr().iloc[0, 1]
correlation

-0.03687844593260901